<template>
  <div class="container">
    <h1 style="color: #5e9ca0;">Q&amp;A Page</h1>
    <br>
    <h2 style="color: #2e6c80;">Loser NFT</h2>
    <p>NFT全称为Non-Fungible Token，非同质化代币，是用于表示数字资产的唯一加密货币令牌，具有不可分割、不可代替、独一无二等特点。</p>
    <p>Loser NFT是一款依附于币安智能链上发布的token，符合ERC721的标准。您可以在<a href="https://testnet.bscscan.com/token/0x9715143c7a5aae7b52b930087303d1566bed9c2c" rel="nofollow">bscScan</a>上查询该币的发行总量，交易记录等相关信息。</p>
    <p>此外，我们的Loser NFT还基于ERC1967标准开发，我们可以于必要时候在不改变合约地址的前提下对合约进行升级。请放心，升级合约并不会改变链上的储存内容，升级后您依旧持有原来的代币，交易历史也不会发生改变。当前NFT所使用的是第一版合约，您同样可以在<a href="https://testnet.bscscan.com/address/0x8483135ae2b7778146c7edacb9551656c6f043b8" rel="nofollow">bscScan</a>查看合同的相关内容。</p>
    <p>除了ERC721标准所对应的接口外，我们当前的NFT采用群组化的模式，每个NFT都有对应的群组，其ID由群组负责分配。当你获取某个NFT的URI时，合约将查询并提供该NFT所对应群组的URI，用户可以根据该URI识别该代币指向的内容。</p>
    <h2 style="color: #2e6c80;">发行流程</h2>
    <p>代币的发行流程分为两个阶段。</p>
    <p>第一阶段：合约的管理者调用当前智能合约的发行接口，设置发行方、最大发行量以及群组URI的信息。其后，智能合约将发送该群组的第一个NFT至发行方地址。</p>
    <p>第二阶段：如果该群组的最大发行量大于1，则进入发行阶段。发行方可以通过与<a href="https://testnet.bscscan.com/address/0x2d0d4cc1d4962d2070578811d3da94fb610c9c92">LowbMarket智能合约</a>交互的方式以两种形式发行Loser NFT。</p>
    <p>(1) 竞价模式：所有人都可以对发行阶段的NFT进行报价，发行方可以选择合适的标的成交。</p>
    <p>(2) 公开销售：发行方可以设置一个金额公开发售该组NFT，任何人都可以以不低于该金额的Lowb获得一个该群组的NFT。在发行阶段，发行方可随时更改公开发售的最低金额。</p>
    <p>成交后NFT合约将直接发送一个当前群组的NFT至买家地址中，而买家所支付的Lowb中的50%将暂存于发行方在市场的钱包中，作为对创作者的激励。</p>
    <p>操作提示：发行方首先要授权NFT给合约地址才能进行发行操作，同样地，买家也需要先授权合约地址足够的Lowb才能执行直接购买NFT的操作。</p>
    <h2 style="color: #2e6c80;">自由流通阶段</h2>
    <p>当某个群组的流通数量到达最大发行量时，市场将进入自由交易阶段。发行阶段的报价单将继续保留，在自由流通阶段买家可以继续对某个群组的NFT进行报价。同时，持有该群组NFT的卖家也可以进行报价。买卖双方可以自由选择合适的报价单成交。</p>
    <p>成交后NFT将从卖家地址转入买家地址，而买家所支付的Lowb中的96%将存入卖家的市场钱包中，另外2%存入发行方的市场钱包中，作为对创作者的激励。</p>
    <p>操作提示：卖家要先授权NFT给合约地址才能对其进行直接卖出以及报价操作。</p>
    <h2 style="color: #2e6c80;">关于市场钱包余额</h2>
    <p>用户可自行往市场钱包充提Lowb。买家进行报价时将使用市场钱包的余额而不是自己钱包的余额。报价的金额将被LowbMarket合约锁定，并在报价单撤销时予以返还。</p>
  </div>
</template>